#include <stdio.h>

void countCall() {
    int counter = 0;
    counter++;
    printf("Call Function: Counter =  %d\n", counter);
}
int main() {
    printf("Starting function calls...\n");
    countCall();  
    printf("After first call:\n");
    countCall();  
    return 0;
}

/* 1. ผลลัพธ์ที่ได้ต่างกันอย่างไร? เพราะเหตุใด?
กรณีที่ 1 (static): ค่าของ counter จะ จำค่าเดิมไว้ระหว่างการเรียกฟังก์ชัน
เช่น: 1 → 2 → 3
กรณีที่ 2 (non-static): ค่าของ counter จะ รีเซ็ตเป็น 0 ทุกครั้งเมื่อเรียกฟังก์ชัน
เช่น: 1 → 1 → 1
เพราะตัวแปร static ถูกสร้างครั้งเดียว และเก็บค่าไว้ตลอดในขณะที่ int ธรรมดาจะสร้างใหม่ทุกครั้งที่เรียกฟังก์ชัน 
2. ความแตกต่างสำคัญของ Non-Static Variable?
ตัวแปร Non-Static จะ:สร้างใหม่ทุกครั้งที่ฟังก์ชันถูกเรียก มีอายุเพียงในช่วงที่ฟังก์ชันทำงานเท่านั้น ค่าเดิมจะหายไปทุกครั้งที่เรียกใหม่
3. อภิปราย และสรุปผลที่ได้จากการทดลอง
การใช้ static มีประโยชน์เมื่อเราต้องการให้ฟังก์ชันจำสถานะหรือค่าเดิมได้ เช่น ตัวนับจำนวนครั้งที่เรียก
หากใช้ int ปกติในกรณีนี้ จะทำให้ค่าถูกรีเซ็ต ทำให้ไม่สามารถติดตามค่าเดิมได้
การเข้าใจความแตกต่างของตัวแปร static/non-static สำคัญในการเขียนโปรแกรมที่มีความซับซ้อนหรือใช้สถานะ (state) */