#include <stdio.h>
int main() {
    float score = 90.5;
    printf("Score = %.1f\n", score);
    return 0;
}

/*1.ผลลัพธ์ที่ได้ ของ int: Score = 90
ผลลัพธ์ที่ได้ ของ float: Score = 90.5
2.ทำไมต้องเลือก Data Type ให้ถูกต้อง?
เพราะถ้าเลือก Data Type ไม่เหมาะสม เช่น เก็บค่าทศนิยมลงใน int จะทำให้ข้อมูลสูญหายหรือผิดเพี้ยนจากที่ตั้งใจไว้
3.อภิปรายและสรุปผล:
จากการทดลองพบว่า int เหมาะสำหรับตัวเลขจำนวนเต็มเท่านั้น ไม่สามารถเก็บค่าทศนิยมได้
การใช้ float ทำให้โปรแกรมสามารถจัดเก็บและแสดงค่าทศนิยมได้อย่างถูกต้อง ซึ่งจำเป็นมากในกรณีที่ค่ามีความละเอียด */